package singleflightpattern

import (
	"context"
	"errors"
	"sync"
)

// Структура вызова: ошибочка, значение (что пользователь запросил) и канал done - надо для сигнала завершения работы вызова
type call struct {
	err   error
	value any
	done  chan struct{}
}

// Реализация паттерна SingleFlight, типо есть библиотека для этого специальная, и там впринципе все поаккуратнее, но мне все равно
type SingleFlight struct {
	//Вот тут у нас мутки и куллсы в избе, ну типо Мьютексы для синхронизации и собстнна массив вызовов, некое множество, которое хранит вызовы
	mutex sync.Mutex
	calls map[string]*call
}

// Конструктор, вот многие могут спросить или не могу - зачем указатель?
// А это за тем, чтоб у тебя в структуре SingleFlight есть массив вызвов, ну вот к нему много кто обращаться будет, там неважно кто - фрики всякие (горутины)
// И вот, чтоб каждый фрик не создавал свою собственную песочницу нужен указатель, чтоб все в одном котле варились (указатель указывает на один определенный объект)
// По такому же принципу и в структуре вызвово указатель на определенный вызво
func NewSingleFlight() *SingleFlight {
	return &SingleFlight{
		calls: make(map[string]*call),
	}
}

// Реализация метода Do, кстати щас прохожу Syberia 2 и мне пиздец первая часть понравилась, я кароче очень кайфанул от антуража и атмосферы.
// Там забавно сделаны карикатурные русские алкаши во второй части, меня оч позабавило, но вот первой части ремастеред такой - мне дак больше оригинал понравился, но кому как
// Но от ремастереда я тоже кайфанул на славу, оч красиво выполнен маленький город Валадилена
func (s *SingleFlight) Do(ctx context.Context, key string, action func(ctx context.Context) (any, error)) (any, error) {
	//Тут локаем и ищем вызов, понятное дело это все пример
	s.mutex.Lock()
	if call, found := s.calls[key]; found {
		s.mutex.Unlock()
		return s.wait(ctx, call)
	}

	//Коли вызов не нашли, то создаем его, опять же вызов - это вызов пользователя, типо понадобилось ему че-то от моего хранилища и он вызывает нужные ему данные
	call := &call{
		done: make(chan struct{}),
	}

	//Задаем для ключа в таблице (ключ-значение) - вызов, который сделали
	s.calls[key] = call
	//Ну и анлокаем, спрашивается - нахуя локали, если все равно открыли?
	//А локали мы чтоб wait, который лезет своими грязными битовыми пальчиками в s.calls, вкратце, это для конкуретности, а че такое конкуретность сами нануглите - не маленькие
	s.mutex.Unlock()

	//Далее горутинка, которая выполняет какое-то действие, а че за действие?
	//Ну я вам че, черт какой-то расписывать тут тяжелые запросы к БД, которой несуществует, наэмаджинировал вам за щеку уже
	go func() {
		//Деферка функции, а нахуя мне дефер спросит разрабочик, ну во-превых код не мой, я его больше себе объясняю
		//Во-вторых дефер нужен для выполнения в любом случае - хоть у тебя понос за компом начнется, а код под дефером все равно будет в конце
		defer func() {
			//рековери, а че это? А она типо там панику ловит и, потом пу-пу-пу, ну там, кароче эм .........................................
			//Давай разберемся вместе, recover — это встроенная функция в Go, которая останавливает панику и возвращает значение, переданное в panic, но только если вызвана внутри defer-функции.
			if v := recover(); v != nil {
				call.err = errors.New("error from single flight")
			}

			//Потом мы канал закрываем, сигнализируем остановку
			close(call.done)

			//Че-то лочим
			s.mutex.Lock()
			//Че-то удаляем
			delete(s.calls, key)
			//Че-то анлочим
			s.mutex.Unlock()
		}()

		//Записываем в значение, ошибку и че получили
		call.value, call.err = action(ctx)
	}()

	//Ну и вэйтка
	return s.wait(ctx, call)
}

// Функция ожидания (че сморозил), ну кароче, это gracefull shutdown с выводом значений из вызова
// Вот вы скажете:"Бе-бе-бе, как это вообще можно протестить, нужны нормальные тестовые как в рабочих средах", - наэмоджинировал вам тестовых за щеку, проверяйте
// Отказоустойчивую полость рта вам щас навайбкожу
func (s *SingleFlight) wait(ctx context.Context, call *call) (any, error) {
	select {
	case <-ctx.Done():
		return nil, ctx.Err()
	case <-call.done:
		return call.value, call.err
	}
}
